{
  "_name_or_path": "outputs/checkpoints/v2_small_60m_init/checkpoint-0",
  "activation_dropout": 0.0,
  "activation_function": "swish",
  "architectures": [
    "MarianMTModel"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "d_model": 576,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2304,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 2,
  "decoder_start_token_id": 0,
  "decoder_vocab_size": 24000,
  "dropout": 0.1,
  "dtype": "float32",
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2304,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 8,
  "eos_token_id": 2,
  "forced_eos_token_id": null,
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "max_position_embeddings": 512,
  "model_type": "marian",
  "num_hidden_layers": 8,
  "pad_token_id": 0,
  "scale_embedding": true,
  "share_encoder_decoder_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "use_cache": true,
  "vocab_size": 24000
}
